Tekla Open API Reference for Tekla Structures 2025
SectionMarkTagAttributes Properties
The SectionMarkBase.SectionMarkTagAttributes type exposes the following members.
Properties
Name | Description
Location
 The location of the mark tag.
 (Inherited from ViewMarkBasicTagAttributes.)
Offset
 The offset of the mark tag.
 (Inherited from ViewMarkBasicTagAttributes.)
ShowOnSide
 The side(s) on which the tag is shown.
TagContent
 The tag content.
 (Inherited from ViewMarkBasicTagAttributes.)
TagRotation
 The policy for the tag rotation.
Top
See Also
Reference
SectionMarkBase.SectionMarkTagAttributes Class
Tekla.Structures.Drawing Namespace